betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_adc.c
/**
  *
  * @file    apm32f4xx_ddl_adc.c
  * @brief   ADC DDL module driver
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#if defined(USE_FULL_DDL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_ddl_adc.h"
#include "apm32f4xx_ddl_bus.h"

#ifdef  USE_FULL_ASSERT
  #include "apm32_assert.h"
#else
#ifndef ASSERT_PARAM
    #define ASSERT_PARAM(_PARAM_) ((void)(0U))
#endif
#endif

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined (ADC1) || defined (ADC2) || defined (ADC3)

/** @addtogroup ADC_DDL ADC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/** @addtogroup ADC_DDL_Private_Macros
  * @{
  */

/* Check of parameters for configuration of ADC hierarchical scope:           */
/* common to several ADC instances.                                           */
#define IS_DDL_ADC_COMMON_CLOCK(__CLOCK__)                                      \
  (   ((__CLOCK__) == DDL_ADC_CLOCK_SYNC_PCLK_DIV2)                             \
   || ((__CLOCK__) == DDL_ADC_CLOCK_SYNC_PCLK_DIV4)                             \
   || ((__CLOCK__) == DDL_ADC_CLOCK_SYNC_PCLK_DIV6)                             \
   || ((__CLOCK__) == DDL_ADC_CLOCK_SYNC_PCLK_DIV8)                             \
  )

/* Check of parameters for configuration of ADC hierarchical scope:           */
/* ADC instance.                                                              */
#define IS_DDL_ADC_RESOLUTION(__RESOLUTION__)                                   \
  (   ((__RESOLUTION__) == DDL_ADC_RESOLUTION_12B)                              \
   || ((__RESOLUTION__) == DDL_ADC_RESOLUTION_10B)                              \
   || ((__RESOLUTION__) == DDL_ADC_RESOLUTION_8B)                               \
   || ((__RESOLUTION__) == DDL_ADC_RESOLUTION_6B)                               \
  )

#define IS_DDL_ADC_DATA_ALIGN(__DATA_ALIGN__)                                   \
  (   ((__DATA_ALIGN__) == DDL_ADC_DATA_ALIGN_RIGHT)                            \
   || ((__DATA_ALIGN__) == DDL_ADC_DATA_ALIGN_LEFT)                             \
  )

#define IS_DDL_ADC_SCAN_SELECTION(__SCAN_SELECTION__)                           \
  (   ((__SCAN_SELECTION__) == DDL_ADC_SEQ_SCAN_DISABLE)                        \
   || ((__SCAN_SELECTION__) == DDL_ADC_SEQ_SCAN_ENABLE)                         \
  )

#define IS_DDL_ADC_SEQ_SCAN_MODE(__SEQ_SCAN_MODE__)                             \
  (   ((__SCAN_MODE__) == DDL_ADC_SEQ_SCAN_DISABLE)                             \
   || ((__SCAN_MODE__) == DDL_ADC_SEQ_SCAN_ENABLE)                              \
  )

/* Check of parameters for configuration of ADC hierarchical scope:           */
/* ADC group regular                                                          */
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
#define IS_DDL_ADC_REG_TRIG_SOURCE(__REG_TRIG_SOURCE__)                         \
  (   ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_SOFTWARE)                      \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR1_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR1_CH2)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR1_CH3)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR2_CH2)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR2_CH3)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR2_CH4)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR2_TRGO)                 \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR3_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR3_TRGO)                 \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR4_CH4)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR5_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR5_CH2)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR5_CH3)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR8_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR8_TRGO)                 \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_EINT_LINE11)               \
  )
#elif defined (APM32F403xx) || defined (APM32F402xx)
#define IS_DDL_ADC_REG_TRIG_SOURCE(__REG_TRIG_SOURCE__)                         \
  (   ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_SOFTWARE)                      \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR1_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR1_CH2)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR1_CH3)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR2_CH2)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR2_CH3)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR3_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR3_TRGO)                 \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR4_CH4)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR5_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR5_CH3)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR8_CH1)                  \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_TMR8_TRGO)                 \
   || ((__REG_TRIG_SOURCE__) == DDL_ADC_REG_TRIG_EXT_EINT_LINE11)               \
  )
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
#define IS_DDL_ADC_REG_CONTINUOUS_MODE(__REG_CONTINUOUS_MODE__)                 \
  (   ((__REG_CONTINUOUS_MODE__) == DDL_ADC_REG_CONV_SINGLE)                    \
   || ((__REG_CONTINUOUS_MODE__) == DDL_ADC_REG_CONV_CONTINUOUS)                \
  )

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
#define IS_DDL_ADC_REG_DMA_TRANSFER(__REG_DMA_TRANSFER__)                       \
  (   ((__REG_DMA_TRANSFER__) == DDL_ADC_REG_DMA_TRANSFER_NONE)                 \
   || ((__REG_DMA_TRANSFER__) == DDL_ADC_REG_DMA_TRANSFER_LIMITED)              \
   || ((__REG_DMA_TRANSFER__) == DDL_ADC_REG_DMA_TRANSFER_UNLIMITED)            \
  )
#elif defined (APM32F403xx) || defined (APM32F402xx)
#define IS_DDL_ADC_REG_DMA_TRANSFER(__REG_DMA_TRANSFER__)                       \
  (   ((__REG_DMA_TRANSFER__) == DDL_ADC_REG_DMA_TRANSFER_NONE)                 \
   || ((__REG_DMA_TRANSFER__) == DDL_ADC_REG_DMA_TRANSFER_UNLIMITED)            \
  )
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#define IS_DDL_ADC_REG_FLAG_EOC_SELECTION(__REG_FLAG_EOC_SELECTION__)           \
  (   ((__REG_FLAG_EOC_SELECTION__) == DDL_ADC_REG_FLAG_EOC_SEQUENCE_CONV)      \
   || ((__REG_FLAG_EOC_SELECTION__) == DDL_ADC_REG_FLAG_EOC_UNITARY_CONV)       \
  )

#define IS_DDL_ADC_REG_SEQ_SCAN_LENGTH(__REG_SEQ_SCAN_LENGTH__)                 \
  (   ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_DISABLE)               \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_2RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_3RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_4RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_5RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_6RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_7RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_8RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_9RANKS)         \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_10RANKS)        \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_11RANKS)        \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_12RANKS)        \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_13RANKS)        \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_14RANKS)        \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_15RANKS)        \
   || ((__REG_SEQ_SCAN_LENGTH__) == DDL_ADC_REG_SEQ_SCAN_ENABLE_16RANKS)        \
  )

