betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_adc.c
#define IS_DDL_ADC_REG_SEQ_SCAN_DISCONT_MODE(__REG_SEQ_DISCONT_MODE__)          \
  (   ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_DISABLE)           \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_1RANK)             \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_2RANKS)            \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_3RANKS)            \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_4RANKS)            \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_5RANKS)            \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_6RANKS)            \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_7RANKS)            \
   || ((__REG_SEQ_DISCONT_MODE__) == DDL_ADC_REG_SEQ_DISCONT_8RANKS)            \
  )

/* Check of parameters for configuration of ADC hierarchical scope:           */
/* ADC group injected                                                         */
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
#define IS_DDL_ADC_INJ_TRIG_SOURCE(__INJ_TRIG_SOURCE__)                         \
  (   ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_SOFTWARE)                      \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR1_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR1_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR2_CH1)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR2_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR3_CH2)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR3_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR4_CH1)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR4_CH2)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR4_CH3)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR4_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR5_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR5_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR8_CH2)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR8_CH3)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR8_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_EXTI_LINE15)               \
  )

#define IS_DDL_ADC_INJ_TRIG_EXT_EDGE(__INJ_TRIG_EXT_EDGE__)                     \
  (   ((__INJ_TRIG_EXT_EDGE__) == DDL_ADC_INJ_TRIG_EXT_RISING)                  \
   || ((__INJ_TRIG_EXT_EDGE__) == DDL_ADC_INJ_TRIG_EXT_FALLING)                 \
   || ((__INJ_TRIG_EXT_EDGE__) == DDL_ADC_INJ_TRIG_EXT_RISINGFALLING)           \
  )
#elif defined (APM32F403xx) || defined (APM32F402xx)
#define IS_DDL_ADC_INJ_TRIG_SOURCE(__INJ_TRIG_SOURCE__)                         \
  (   ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_SOFTWARE)                      \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR1_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR1_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR2_CH1)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR2_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR3_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR4_CH3)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR4_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR5_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR5_TRGO)                 \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR8_CH2)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_TMR8_CH4)                  \
   || ((__INJ_TRIG_SOURCE__) == DDL_ADC_INJ_TRIG_EXT_EXTI_LINE15)               \
  )

#define IS_DDL_ADC_INJ_TRIG_EXT_EDGE(__INJ_TRIG_EXT_EDGE__)                     \
  (   ((__INJ_TRIG_EXT_EDGE__) == DDL_ADC_INJ_TRIG_EXT_RISING)                  \
  )
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#define IS_DDL_ADC_INJ_TRIG_AUTO(__INJ_TRIG_AUTO__)                             \
  (   ((__INJ_TRIG_AUTO__) == DDL_ADC_INJ_TRIG_INDEPENDENT)                     \
   || ((__INJ_TRIG_AUTO__) == DDL_ADC_INJ_TRIG_FROM_GRP_REGULAR)                \
  )

#define IS_DDL_ADC_INJ_SEQ_SCAN_LENGTH(__INJ_SEQ_SCAN_LENGTH__)                 \
  (   ((__INJ_SEQ_SCAN_LENGTH__) == DDL_ADC_INJ_SEQ_SCAN_DISABLE)               \
   || ((__INJ_SEQ_SCAN_LENGTH__) == DDL_ADC_INJ_SEQ_SCAN_ENABLE_2RANKS)         \
   || ((__INJ_SEQ_SCAN_LENGTH__) == DDL_ADC_INJ_SEQ_SCAN_ENABLE_3RANKS)         \
   || ((__INJ_SEQ_SCAN_LENGTH__) == DDL_ADC_INJ_SEQ_SCAN_ENABLE_4RANKS)         \
  )

#define IS_DDL_ADC_INJ_SEQ_SCAN_DISCONT_MODE(__INJ_SEQ_DISCONT_MODE__)          \
  (   ((__INJ_SEQ_DISCONT_MODE__) == DDL_ADC_INJ_SEQ_DISCONT_DISABLE)           \
   || ((__INJ_SEQ_DISCONT_MODE__) == DDL_ADC_INJ_SEQ_DISCONT_1RANK)             \
  )

#if defined(ADC_MULTIMODE_SUPPORT)
/* Check of parameters for configuration of ADC hierarchical scope:           */
/* multimode.                                                                 */
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
#if defined(ADC3)
#define IS_DDL_ADC_MULTI_MODE(__MULTI_MODE__)                                   \
  (   ((__MULTI_MODE__) == DDL_ADC_MULTI_INDEPENDENT)                           \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIMULT)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INTERL)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_INJ_SIMULT)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_INJ_ALTERN)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INT_INJ_SIM)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_SIM)                \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_TRIPLE_REG_SIM_INJ_ALT)                \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_TRIPLE_INJ_SIMULT)                     \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_TRIPLE_REG_SIMULT)                     \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_TRIPLE_REG_INTERL)                     \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_TRIPLE_INJ_ALTERN)                     \
  )
#else
#define IS_DDL_ADC_MULTI_MODE(__MULTI_MODE__)                                   \
  (   ((__MULTI_MODE__) == DDL_ADC_MULTI_INDEPENDENT)                           \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIMULT)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INTERL)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_INJ_SIMULT)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_INJ_ALTERN)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INT_INJ_SIM)                  \
  )
#endif /* ADC3 */
#elif defined (APM32F403xx) || defined (APM32F402xx)
#define IS_DDL_ADC_MULTI_MODE(__MULTI_MODE__)                                   \
  (   ((__MULTI_MODE__) == DDL_ADC_MULTI_INDEPENDENT)                           \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIMULT)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INTERL_FAST)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INTERL_SLOW)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_INJ_SIMULT)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_INJ_ALTERN)                       \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIM_INJ_SIM)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_SIM_INJ_ALT)                  \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INTFAST_INJ_SIM)              \
   || ((__MULTI_MODE__) == DDL_ADC_MULTI_DUAL_REG_INTSLOW_INJ_SIM)              \
  )
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
#define IS_DDL_ADC_MULTI_DMA_TRANSFER(__MULTI_DMA_TRANSFER__)                   \
  (   ((__MULTI_DMA_TRANSFER__) == DDL_ADC_MULTI_REG_DMA_EACH_ADC)              \
   || ((__MULTI_DMA_TRANSFER__) == DDL_ADC_MULTI_REG_DMA_LIMIT_1)               \
   || ((__MULTI_DMA_TRANSFER__) == DDL_ADC_MULTI_REG_DMA_LIMIT_2)               \
   || ((__MULTI_DMA_TRANSFER__) == DDL_ADC_MULTI_REG_DMA_LIMIT_3)               \
   || ((__MULTI_DMA_TRANSFER__) == DDL_ADC_MULTI_REG_DMA_UNLMT_1)               \
   || ((__MULTI_DMA_TRANSFER__) == DDL_ADC_MULTI_REG_DMA_UNLMT_2)               \
   || ((__MULTI_DMA_TRANSFER__) == DDL_ADC_MULTI_REG_DMA_UNLMT_3)               \
  )

#define IS_DDL_ADC_MULTI_TWOSMP_DELAY(__MULTI_TWOSMP_DELAY__)                   \
  (   ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_5CYCLES)          \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_6CYCLES)          \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_7CYCLES)          \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_8CYCLES)          \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_9CYCLES)          \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_10CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_11CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_12CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_13CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_14CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_15CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_16CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_17CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_18CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_19CYCLES)         \
   || ((__MULTI_TWOSMP_DELAY__) == DDL_ADC_MULTI_TWOSMP_DELAY_20CYCLES)         \
  )

#define IS_DDL_ADC_MULTI_MASTER_SLAVE(__MULTI_MASTER_SLAVE__)                   \
  (   ((__MULTI_MASTER_SLAVE__) == DDL_ADC_MULTI_MASTER)                        \
   || ((__MULTI_MASTER_SLAVE__) == DDL_ADC_MULTI_SLAVE)                         \
   || ((__MULTI_MASTER_SLAVE__) == DDL_ADC_MULTI_MASTER_SLAVE)                  \
  )

#endif /* ADC_MULTIMODE_SUPPORT */
/**
  * @}
  */


