betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_adc.c
/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ADC_DDL_Exported_Functions
  * @{
  */

/** @addtogroup ADC_DDL_EF_Init
  * @{
  */

/**
  * @brief  De-initialize registers of all ADC instances belonging to
  *         the same ADC common instance to their default reset values.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC common registers are de-initialized
  *          - ERROR: not applicable
  */
ErrorStatus DDL_ADC_CommonDeInit(ADC_Common_TypeDef *ADCxy_COMMON)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_COMMON_INSTANCE(ADCxy_COMMON));

  UNUSED(ADCxy_COMMON);

  /* Force reset of ADC clock (core clock) */
  DDL_APB2_GRP1_ForceReset(DDL_APB2_GRP1_PERIPH_ADC1);

  /* Release reset of ADC clock (core clock) */
  DDL_APB2_GRP1_ReleaseReset(DDL_APB2_GRP1_PERIPH_ADC1);

  return SUCCESS;
}

/**
  * @brief  Initialize some features of ADC common parameters
  *         (all ADC instances belonging to the same ADC common instance)
  *         and multimode (for devices with several ADC instances available).
  * @note   The setting of ADC common parameters is conditioned to
  *         ADC instances state:
  *         All ADC instances belonging to the same ADC common instance
  *         must be disabled.
  * @param  ADCxy_COMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __DDL_ADC_COMMON_INSTANCE() )
  * @param  ADC_CommonInitStruct Pointer to a @ref DDL_ADC_CommonInitTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC common registers are initialized
  *          - ERROR: ADC common registers are not initialized
  */
ErrorStatus DDL_ADC_CommonInit(ADC_Common_TypeDef *ADCxy_COMMON, DDL_ADC_CommonInitTypeDef *ADC_CommonInitStruct)
{
  ErrorStatus status = SUCCESS;

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_COMMON_INSTANCE(ADCxy_COMMON));
#if defined (ADC_CCTRL_ADCPRE)
  ASSERT_PARAM(IS_DDL_ADC_COMMON_CLOCK(ADC_CommonInitStruct->CommonClock));
#endif /* ADC_CCTRL_ADCPRE */

#if defined(ADC_MULTIMODE_SUPPORT)
  ASSERT_PARAM(IS_DDL_ADC_MULTI_MODE(ADC_CommonInitStruct->Multimode));
#if defined (ADC_CCTRL_DMAMODE) && defined (ADC_CCTRL_SMPDEL2)
  if(ADC_CommonInitStruct->Multimode != DDL_ADC_MULTI_INDEPENDENT)
  {
    ASSERT_PARAM(IS_DDL_ADC_MULTI_DMA_TRANSFER(ADC_CommonInitStruct->MultiDMATransfer));
    ASSERT_PARAM(IS_DDL_ADC_MULTI_TWOSMP_DELAY(ADC_CommonInitStruct->MultiTwoSamplingDelay));
  }
#endif /* ADC_CCTRL_DMAMODE && ADC_CCTRL_SMPDEL2 */
#endif /* ADC_MULTIMODE_SUPPORT */

  /* Note: Hardware constraint (refer to description of functions             */
  /*       "DDL_ADC_SetCommonXXX()" and "DDL_ADC_SetMultiXXX()"):               */
  /*       On this APM32 series, setting of these features is conditioned to  */
  /*       ADC state:                                                         */
  /*       All ADC instances of the ADC common group must be disabled.        */
  if(__DDL_ADC_IS_ENABLED_ALL_COMMON_INSTANCE(ADCxy_COMMON) == 0UL)
  {
    /* Configuration of ADC hierarchical scope:                               */
    /*  - common to several ADC                                               */
    /*    (all ADC instances belonging to the same ADC common instance)       */
    /*    - Set ADC clock (conversion clock)                                  */
    /*  - multimode (if several ADC instances available on the                */
    /*    selected device)                                                    */
    /*    - Set ADC multimode configuration                                   */
    /*    - Set ADC multimode DMA transfer                                    */
    /*    - Set ADC multimode: delay between 2 sampling phases                */
#if defined (ADC_CCTRL_ADCPRE)
#if defined(ADC_MULTIMODE_SUPPORT)
    if(ADC_CommonInitStruct->Multimode != DDL_ADC_MULTI_INDEPENDENT)
    {
      MODIFY_REG(ADCxy_COMMON->CCTRL,
                   ADC_CCTRL_ADCPRE
                 | ADC_CCTRL_ADCMSEL
                 | ADC_CCTRL_DMAMODE
                 | ADC_CCTRL_DMAMODEDISSEL
                 | ADC_CCTRL_SMPDEL2
                ,
                   ADC_CommonInitStruct->CommonClock
                 | ADC_CommonInitStruct->Multimode
                 | ADC_CommonInitStruct->MultiDMATransfer
                 | ADC_CommonInitStruct->MultiTwoSamplingDelay
                );
    }
    else
    {
      MODIFY_REG(ADCxy_COMMON->CCTRL,
                   ADC_CCTRL_ADCPRE
                 | ADC_CCTRL_ADCMSEL
                 | ADC_CCTRL_DMAMODE
                 | ADC_CCTRL_DMAMODEDISSEL
                 | ADC_CCTRL_SMPDEL2
                ,
                   ADC_CommonInitStruct->CommonClock
                 | DDL_ADC_MULTI_INDEPENDENT
                );
    }
#else
    DDL_ADC_SetCommonClock(ADCxy_COMMON, ADC_CommonInitStruct->CommonClock);
#endif /* ADC_MULTIMODE_SUPPORT */
#else
#if defined(ADC_MULTIMODE_SUPPORT)
    if(ADC_CommonInitStruct->Multimode != DDL_ADC_MULTI_INDEPENDENT)
    {
      MODIFY_REG(ADCxy_COMMON->CTRL1,
                 ADC_CTRL1_DUALMCFG,
                 ADC_CommonInitStruct->Multimode
                );
    }
    else
    {
      MODIFY_REG(ADCxy_COMMON->CTRL1,
                 ADC_CTRL1_DUALMCFG,
                 DDL_ADC_MULTI_INDEPENDENT
                );
    }
#endif /* ADC_MULTIMODE_SUPPORT */
#endif /* ADC_CCTRL_ADCPRE */
  }
  else
  {
    /* Initialization error: One or several ADC instances belonging to        */
    /* the same ADC common instance are not disabled.                         */
    status = ERROR;
  }

  return status;
}

/**
  * @brief  Set each @ref DDL_ADC_CommonInitTypeDef field to default value.
  * @param  ADC_CommonInitStruct Pointer to a @ref DDL_ADC_CommonInitTypeDef structure
  *                              whose fields will be set to default values.
  * @retval None
  */
void DDL_ADC_CommonStructInit(DDL_ADC_CommonInitTypeDef *ADC_CommonInitStruct)
{
  /* Set ADC_CommonInitStruct fields to default values */
  /* Set fields of ADC common */
  /* (all ADC instances belonging to the same ADC common instance) */
#if defined (ADC_CCTRL_ADCPRE)
  ADC_CommonInitStruct->CommonClock = DDL_ADC_CLOCK_SYNC_PCLK_DIV2;

#if defined(ADC_MULTIMODE_SUPPORT)
  /* Set fields of ADC multimode */
  ADC_CommonInitStruct->Multimode             = DDL_ADC_MULTI_INDEPENDENT;
  ADC_CommonInitStruct->MultiDMATransfer      = DDL_ADC_MULTI_REG_DMA_EACH_ADC;
  ADC_CommonInitStruct->MultiTwoSamplingDelay = DDL_ADC_MULTI_TWOSMP_DELAY_5CYCLES;
#endif /* ADC_MULTIMODE_SUPPORT */

#else

#if defined(ADC_MULTIMODE_SUPPORT)
  /* Set fields of ADC multimode */
  ADC_CommonInitStruct->Multimode             = DDL_ADC_MULTI_INDEPENDENT;
#endif /* ADC_MULTIMODE_SUPPORT */

