betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_adc.c
#endif /* ADC_CCTRL_ADCPRE */
}

/**
  * @brief  De-initialize registers of the selected ADC instance
  *         to their default reset values.
  * @note   To reset all ADC instances quickly (perform a hard reset),
  *         use function @ref DDL_ADC_CommonDeInit().
  * @param  ADCx ADC instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC registers are de-initialized
  *          - ERROR: ADC registers are not de-initialized
  */
ErrorStatus DDL_ADC_DeInit(ADC_TypeDef *ADCx)
{
  ErrorStatus status = SUCCESS;

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_ALL_INSTANCE(ADCx));

  /* Disable ADC instance if not already disabled.                            */
  if(DDL_ADC_IsEnabled(ADCx) == 1UL)
  {
    /* Set ADC group regular trigger source to SW start to ensure to not      */
    /* have an external trigger event occurring during the conversion stop    */
    /* ADC disable process.                                                   */
    DDL_ADC_REG_SetTriggerSource(ADCx, DDL_ADC_REG_TRIG_SOFTWARE);

    /* Set ADC group injected trigger source to SW start to ensure to not     */
    /* have an external trigger event occurring during the conversion stop    */
    /* ADC disable process.                                                   */
    DDL_ADC_INJ_SetTriggerSource(ADCx, DDL_ADC_INJ_TRIG_SOFTWARE);

    /* Disable the ADC instance */
    DDL_ADC_Disable(ADCx);
  }

  /* Check whether ADC state is compliant with expected state */
  /* (hardware requirements of bits state to reset registers below) */
  if(READ_BIT(ADCx->CTRL2, ADC_CTRL2_ADCEN) == 0UL)
  {
    /* ========== Reset ADC registers ========== */
#if defined (ADC_STS_OVRFLG) && defined (ADC_CTRL1_OVRIEN) && defined (ADC_SMPTIM1_SMPCYCCFG18)
    /* Reset register STS */
    CLEAR_BIT(ADCx->STS,
              (  DDL_ADC_FLAG_STRT
               | DDL_ADC_FLAG_JSTRT
               | DDL_ADC_FLAG_EOCS
               | DDL_ADC_FLAG_OVR
               | DDL_ADC_FLAG_JEOS
               | DDL_ADC_FLAG_AWD1 )
             );

    /* Reset register CTRL1 */
    CLEAR_BIT(ADCx->CTRL1,
              (  ADC_CTRL1_OVRIEN   | ADC_CTRL1_RESSEL     | ADC_CTRL1_REGAWDEN
               | ADC_CTRL1_INJAWDEN
               | ADC_CTRL1_DISCNUMCFG | ADC_CTRL1_INJDISCEN | ADC_CTRL1_REGDISCEN
               | ADC_CTRL1_INJGACEN   | ADC_CTRL1_AWDSGLEN  | ADC_CTRL1_SCANEN
               | ADC_CTRL1_INJEOCIEN  | ADC_CTRL1_AWDIEN   | ADC_CTRL1_EOCIEN
               | ADC_CTRL1_AWDCHSEL                                     )
             );

    /* Reset register CTRL2 */
    CLEAR_BIT(ADCx->CTRL2,
              (  ADC_CTRL2_REGSWSC  | ADC_CTRL2_REGEXTTRGEN  | ADC_CTRL2_REGEXTTRGSEL
               | ADC_CTRL2_INJSWSC | ADC_CTRL2_INJEXTTRGEN | ADC_CTRL2_INJGEXTTRGSEL
               | ADC_CTRL2_DALIGNCFG    | ADC_CTRL2_EOCSEL
               | ADC_CTRL2_DMADISSEL      | ADC_CTRL2_DMAEN
               | ADC_CTRL2_CONTCEN     | ADC_CTRL2_ADCEN                    )
             );

#if defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
    /* Reset register OSAMPCTRL */
    CLEAR_BIT(ADCx->OSAMPCTRL,
              (  ADC_OSAMPCTRL_OSEN | ADC_OSAMPCTRL_OSR | ADC_OSAMPCTRL_OSS
               | ADC_OSAMPCTRL_TOS)
              );
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

    /* Reset register SMPTIM1 */
    CLEAR_BIT(ADCx->SMPTIM1,
              (  ADC_SMPTIM1_SMPCYCCFG18 | ADC_SMPTIM1_SMPCYCCFG17 | ADC_SMPTIM1_SMPCYCCFG16
               | ADC_SMPTIM1_SMPCYCCFG15 | ADC_SMPTIM1_SMPCYCCFG14 | ADC_SMPTIM1_SMPCYCCFG13
               | ADC_SMPTIM1_SMPCYCCFG12 | ADC_SMPTIM1_SMPCYCCFG11 | ADC_SMPTIM1_SMPCYCCFG10)
             );
#else
    /* Reset register STS */
    CLEAR_BIT(ADCx->STS,
              (  DDL_ADC_FLAG_STRT
               | DDL_ADC_FLAG_JSTRT
               | DDL_ADC_FLAG_EOCS
               | DDL_ADC_FLAG_JEOS
               | DDL_ADC_FLAG_AWD1 )
             );

    /* Reset register CTRL1 */
    CLEAR_BIT(ADCx->CTRL1,
              (  ADC_CTRL1_REGAWDEN   | ADC_CTRL1_INJAWDEN  | ADC_CTRL1_DUALMCFG
               | ADC_CTRL1_DISCNUMCFG | ADC_CTRL1_INJDISCEN | ADC_CTRL1_REGDISCEN
               | ADC_CTRL1_INJGACEN   | ADC_CTRL1_AWDSGLEN  | ADC_CTRL1_SCANEN
               | ADC_CTRL1_INJEOCIEN  | ADC_CTRL1_AWDIEN   | ADC_CTRL1_EOCIEN
               | ADC_CTRL1_AWDCHSEL                                     )
             );

    /* Reset register CTRL2 */
    CLEAR_BIT(ADCx->CTRL2,
              (  ADC_CTRL2_TSVREFEN    | ADC_CTRL2_REGSWSC      | ADC_CTRL2_INJSWSC
               | ADC_CTRL2_REGEXTTRGEN | ADC_CTRL2_REGEXTTRGSEL | ADC_CTRL2_INJEXTTRGEN
               | ADC_CTRL2_INJGEXTTRGSEL    | ADC_CTRL2_DALIGNCFG | ADC_CTRL2_DMAEN
               | ADC_CTRL2_CALRST       | ADC_CTRL2_CAL     | ADC_CTRL2_CONTCEN
               | ADC_CTRL2_ADCEN )
             );

    /* Reset register SMPTIM1 */
    CLEAR_BIT(ADCx->SMPTIM1,
              (  ADC_SMPTIM1_SMPCYCCFG17 | ADC_SMPTIM1_SMPCYCCFG16
               | ADC_SMPTIM1_SMPCYCCFG15 | ADC_SMPTIM1_SMPCYCCFG14 | ADC_SMPTIM1_SMPCYCCFG13
               | ADC_SMPTIM1_SMPCYCCFG12 | ADC_SMPTIM1_SMPCYCCFG11 | ADC_SMPTIM1_SMPCYCCFG10)
             );
#endif /* ADC_STS_OVRFLG && ADC_CTRL1_OVRIEN && ADC_SMPTIM1_SMPCYCCFG18 */

    /* Reset register SMPTIM2 */
    CLEAR_BIT(ADCx->SMPTIM2,
              (  ADC_SMPTIM2_SMPCYCCFG9
               | ADC_SMPTIM2_SMPCYCCFG8 | ADC_SMPTIM2_SMPCYCCFG7 | ADC_SMPTIM2_SMPCYCCFG6
               | ADC_SMPTIM2_SMPCYCCFG5 | ADC_SMPTIM2_SMPCYCCFG4 | ADC_SMPTIM2_SMPCYCCFG3
               | ADC_SMPTIM2_SMPCYCCFG2 | ADC_SMPTIM2_SMPCYCCFG1 | ADC_SMPTIM2_SMPCYCCFG0)
             );

    /* Reset register INJDOF1 */
    CLEAR_BIT(ADCx->INJDOF1, ADC_INJDOF1_INJDOF1);
    /* Reset register INJDOF2 */
    CLEAR_BIT(ADCx->INJDOF2, ADC_INJDOF2_INJDOF2);
    /* Reset register INJDOF3 */
    CLEAR_BIT(ADCx->INJDOF3, ADC_INJDOF3_INJDOF3);
    /* Reset register INJDOF4 */
    CLEAR_BIT(ADCx->INJDOF4, ADC_INJDOF4_INJDOF4);

    /* Reset register AWDHT */
    SET_BIT(ADCx->AWDHT, ADC_AWDHT_AWDHT);
    /* Reset register AWDLT */
    CLEAR_BIT(ADCx->AWDLT, ADC_AWDLT_AWDLT);

