betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_adc.c
    /* Reset register REGSEQ1 */
    CLEAR_BIT(ADCx->REGSEQ1,
              (  ADC_REGSEQ1_REGSEQLEN
               | ADC_REGSEQ1_REGSEQC16
               | ADC_REGSEQ1_REGSEQC15 | ADC_REGSEQ1_REGSEQC14 | ADC_REGSEQ1_REGSEQC13)
             );

    /* Reset register REGSEQ2 */
    CLEAR_BIT(ADCx->REGSEQ2,
              (  ADC_REGSEQ2_REGSEQC12 | ADC_REGSEQ2_REGSEQC11 | ADC_REGSEQ2_REGSEQC10
               | ADC_REGSEQ2_REGSEQC9 | ADC_REGSEQ2_REGSEQC8 | ADC_REGSEQ2_REGSEQC7)
             );

    /* Reset register REGSEQ3 */
    CLEAR_BIT(ADCx->REGSEQ3,
              (  ADC_REGSEQ3_REGSEQC6 | ADC_REGSEQ3_REGSEQC5 | ADC_REGSEQ3_REGSEQC4
               | ADC_REGSEQ3_REGSEQC3 | ADC_REGSEQ3_REGSEQC2 | ADC_REGSEQ3_REGSEQC1)
             );

    /* Reset register INJSEQ */
    CLEAR_BIT(ADCx->INJSEQ,
              (  ADC_INJSEQ_INJSEQLEN
               | ADC_INJSEQ_INJSEQC4 | ADC_INJSEQ_INJSEQC3
               | ADC_INJSEQ_INJSEQC2 | ADC_INJSEQ_INJSEQC1  )
             );

    /* Reset register REGDATA */
    /* bits in access mode read only, no direct reset applicable */

    /* Reset registers INJDATA1, INJDATA2, INJDATA3, INJDATA4 */
    /* bits in access mode read only, no direct reset applicable */
#if defined (ADC_CCTRL_TSVREFEN)
    /* Reset register CCTRL */
#if defined(ADC1) && defined(ADC2) && defined(ADC3)
    CLEAR_BIT(ADC->CCTRL, ADC_CCTRL_TSVREFEN | ADC_CCTRL_ADCPRE);
#else
    CLEAR_BIT(ADC1_C->CCTRL, ADC_CCTRL_TSVREFEN | ADC_CCTRL_ADCPRE);
    CLEAR_BIT(ADC2_C->CCTRL, ADC_CCTRL_TSVREFEN | ADC_CCTRL_ADCPRE);
#endif /* ADC2 || ADC3 */
#endif /* ADC_CCTRL_TSVREFEN */
  }

  return status;
}

/**
  * @brief  Initialize some features of ADC instance.
  * @note   These parameters have an impact on ADC scope: ADC instance.
  *         Affects both group regular and group injected (availability
  *         of ADC group injected depends on APM32 families).
  *         Refer to corresponding unitary functions into
  *         @ref ADC_DDL_EF_Configuration_ADC_Instance .
  * @note   The setting of these parameters by function @ref DDL_ADC_Init()
  *         is conditioned to ADC state:
  *         ADC instance must be disabled.
  *         This condition is applied to all ADC features, for efficiency
  *         and compatibility over all APM32 families. However, the different
  *         features can be set under different ADC state conditions
  *         (setting possible with ADC enabled without conversion on going,
  *         ADC enabled with conversion on going, ...)
  *         Each feature can be updated afterwards with a unitary function
  *         and potentially with ADC in a different state than disabled,
  *         refer to description of each function for setting
  *         conditioned to ADC state.
  * @note   After using this function, some other features must be configured
  *         using LL unitary functions.
  *         The minimum configuration remaining to be done is:
  *          - Set ADC group regular or group injected sequencer:
  *            map channel on the selected sequencer rank.
  *            Refer to function @ref DDL_ADC_REG_SetSequencerRanks().
  *          - Set ADC channel sampling time
  *            Refer to function DDL_ADC_SetChannelSamplingTime();
  * @param  ADCx ADC instance
  * @param  ADC_InitStruct Pointer to a @ref DDL_ADC_REG_InitTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC registers are initialized
  *          - ERROR: ADC registers are not initialized
  */
ErrorStatus DDL_ADC_Init(ADC_TypeDef *ADCx, DDL_ADC_InitTypeDef *ADC_InitStruct)
{
  ErrorStatus status = SUCCESS;

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_ALL_INSTANCE(ADCx));

#if defined (ADC_CTRL1_RESSEL)
  ASSERT_PARAM(IS_DDL_ADC_RESOLUTION(ADC_InitStruct->Resolution));
#endif /* ADC_CTRL1_RESSEL */
  ASSERT_PARAM(IS_DDL_ADC_DATA_ALIGN(ADC_InitStruct->DataAlignment));
  ASSERT_PARAM(IS_DDL_ADC_SCAN_SELECTION(ADC_InitStruct->SequencersScanMode));

  /* Note: Hardware constraint (refer to description of this function):       */
  /*       ADC instance must be disabled.                                     */
  if(DDL_ADC_IsEnabled(ADCx) == 0UL)
  {
    /* Configuration of ADC hierarchical scope:                               */
    /*  - ADC instance                                                        */
    /*    - Set ADC data resolution                                           */
    /*    - Set ADC conversion data alignment                                 */
#if defined (ADC_CTRL1_RESSEL)
    MODIFY_REG(ADCx->CTRL1,
                 ADC_CTRL1_RESSEL
               | ADC_CTRL1_SCANEN
              ,
                 ADC_InitStruct->Resolution
               | ADC_InitStruct->SequencersScanMode
              );
#else
    MODIFY_REG(ADCx->CTRL1,
                 ADC_CTRL1_SCANEN
              ,
                 ADC_InitStruct->SequencersScanMode
              );
#endif  /* ADC_CTRL1_RESSEL */

    MODIFY_REG(ADCx->CTRL2,
                 ADC_CTRL2_DALIGNCFG
              ,
                 ADC_InitStruct->DataAlignment
              );

  }
  else
  {
    /* Initialization error: ADC instance is not disabled. */
    status = ERROR;
  }
  return status;
}

/**
  * @brief  Set each @ref DDL_ADC_InitTypeDef field to default value.
  * @param  ADC_InitStruct Pointer to a @ref DDL_ADC_InitTypeDef structure
  *                        whose fields will be set to default values.
  * @retval None
  */
void DDL_ADC_StructInit(DDL_ADC_InitTypeDef *ADC_InitStruct)
{
  /* Set ADC_InitStruct fields to default values */
  /* Set fields of ADC instance */
#if defined (ADC_CTRL1_RESSEL)
  ADC_InitStruct->Resolution    = DDL_ADC_RESOLUTION_12B;
#endif /* ADC_CTRL1_RESSEL */
  ADC_InitStruct->DataAlignment = DDL_ADC_DATA_ALIGN_RIGHT;

  /* Enable scan mode to have a generic behavior with ADC of other            */
  /* APM32 families, without this setting available:                          */
  /* ADC group regular sequencer and ADC group injected sequencer depend      */
  /* only of their own configuration.                                         */
  ADC_InitStruct->SequencersScanMode      = DDL_ADC_SEQ_SCAN_ENABLE;

